// ✅ 자동 생성 파일입니다. (scripts/generate-country-centers.mjs)
// 필요하면 여기서 수동으로 일부 국가명을 alias 처리해도 됩니다.

export const countryCenters: Record<string, { lat: number; lng: number }> = {
  "영국": {
    "lat": 51.5,
    "lng": -0.08
  },
  "기니비사우": {
    "lat": 11.85,
    "lng": -15.58
  },
  "누벨칼레도니": {
    "lat": -22.27,
    "lng": 166.45
  },
  "뉴질랜드": {
    "lat": -41.3,
    "lng": 174.78
  },
  "볼리비아": {
    "lat": -19.02,
    "lng": -65.26
  },
  "모리셔스": {
    "lat": -20.15,
    "lng": 57.48
  },
  "아르메니아": {
    "lat": 40.17,
    "lng": 44.5
  },
  "튀니지": {
    "lat": 36.8,
    "lng": 10.18
  },
  "그레나다": {
    "lat": 32.38,
    "lng": -64.68
  },
  "에티오피아": {
    "lat": 9.03,
    "lng": 38.7
  },
  "루마니아": {
    "lat": 44.43,
    "lng": 26.1
  },
  "우간다": {
    "lat": 0.32,
    "lng": 32.55
  },
  "방글라데시": {
    "lat": 23.72,
    "lng": 90.4
  },
  "호주": {
    "lat": -35.27,
    "lng": 149.13
  },
  "생바르텔레미": {
    "lat": 17.88,
    "lng": -62.85
  },
  "파나마": {
    "lat": 8.97,
    "lng": -79.53
  },
  "코스타리카": {
    "lat": 9.93,
    "lng": -84.09
  },
  "아메리칸사모아": {
    "lat": -14.27,
    "lng": -170.7
  },
  "크로아티아": {
    "lat": 45.8,
    "lng": 16
  },
  "이란": {
    "lat": 35.7,
    "lng": 51.42
  },
  "포클랜드 제도": {
    "lat": -51.7,
    "lng": -57.85
  },
  "미국": {
    "lat": 38.89,
    "lng": -77.05
  },
  "파키스탄": {
    "lat": 33.68,
    "lng": 73.05
  },
  "모잠비크": {
    "lat": -25.95,
    "lng": 32.58
  },
  "슬로바키아": {
    "lat": 48.15,
    "lng": 17.12
  },
  "앙골라": {
    "lat": -8.83,
    "lng": 13.22
  },
  "산마리노": {
    "lat": 43.94,
    "lng": 12.45
  },
  "북마케도니아": {
    "lat": 42,
    "lng": 21.43
  },
  "코코스 제도": {
    "lat": -12.17,
    "lng": 96.83
  },
  "맨섬": {
    "lat": 54.15,
    "lng": -4.48
  },
  "카보베르데": {
    "lat": 14.92,
    "lng": -23.52
  },
  "사모아": {
    "lat": -13.82,
    "lng": -171.77
  },
  "룩셈부르크": {
    "lat": 49.6,
    "lng": 6.12
  },
  "핏케언 제도": {
    "lat": -25.07,
    "lng": -130.08
  },
  "에스와티니": {
    "lat": -26.32,
    "lng": 31.13
  },
  "라오스": {
    "lat": 17.97,
    "lng": 102.6
  },
  "중앙아프리카 공화국": {
    "lat": 4.37,
    "lng": 18.58
  },
  "이라크": {
    "lat": 33.33,
    "lng": 44.4
  },
  "필리핀": {
    "lat": 14.6,
    "lng": 120.97
  },
  "덴마크": {
    "lat": 55.67,
    "lng": 12.58
  },
  "레소토": {
    "lat": -29.32,
    "lng": 27.48
  },
  "엘살바도르": {
    "lat": 13.7,
    "lng": -89.2
  },
  "벨기에": {
    "lat": 50.83,
    "lng": 4.33
  },
  "프랑스령 기아나": {
    "lat": 4.94,
    "lng": -52.33
  },
  "쿠바": {
    "lat": 23.12,
    "lng": -82.35
  },
  "쿡 제도": {
    "lat": -21.2,
    "lng": -159.77
  },
  "캐나다": {
    "lat": 45.42,
    "lng": -75.7
  },
  "르완다": {
    "lat": -1.95,
    "lng": 30.05
  },
  "리히텐슈타인": {
    "lat": 47.13,
    "lng": 9.52
  },
  "멕시코": {
    "lat": 19.43,
    "lng": -99.13
  },
  "세인트빈센트 그레나딘": {
    "lat": 13.13,
    "lng": -61.22
  },
  "페루": {
    "lat": -12.05,
    "lng": -77.05
  },
  "남극": {
    "lat": -90,
    "lng": 0
  },
  "토켈라우": {
    "lat": -9.38,
    "lng": -171.22
  },
  "이집트": {
    "lat": 30.05,
    "lng": 31.25
  },
  "핀란드": {
    "lat": 60.17,
    "lng": 24.93
  },
  "브루나이": {
    "lat": 4.88,
    "lng": 114.93
  },
  "아일랜드": {
    "lat": 53.32,
    "lng": -6.23
  },
  "요르단": {
    "lat": 31.95,
    "lng": 35.93
  },
  "기니": {
    "lat": 9.5,
    "lng": -13.7
  },
  "아루바": {
    "lat": 12.52,
    "lng": -70.03
  },
  "부르키나파소": {
    "lat": 12.37,
    "lng": -1.52
  },
  "콩고 민주 공화국": {
    "lat": -4.32,
    "lng": 15.3
  },
  "사우디아라비아": {
    "lat": 24.65,
    "lng": 46.7
  },
  "슬로베니아": {
    "lat": 46.05,
    "lng": 14.52
  },
  "세네갈": {
    "lat": 14.73,
    "lng": -17.63
  },
  "바레인": {
    "lat": 26.23,
    "lng": 50.57
  },
  "이탈리아": {
    "lat": 41.9,
    "lng": 12.48
  },
  "북마리아나 제도": {
    "lat": 15.2,
    "lng": 145.75
  },
  "몰도바": {
    "lat": 47.01,
    "lng": 28.9
  },
  "토고": {
    "lat": 6.14,
    "lng": 1.21
  },
  "허드 맥도널드 제도": {
    "lat": -53.0818,
    "lng": 73.5042
  },
  "세인트키츠 네비스": {
    "lat": 17.3,
    "lng": -62.72
  },
  "카타르": {
    "lat": 25.28,
    "lng": 51.53
  },
  "영국령 버진아일랜드": {
    "lat": 18.42,
    "lng": -64.62
  },
  "베냉": {
    "lat": 6.48,
    "lng": 2.62
  },
  "앵귈라": {
    "lat": 18.22,
    "lng": -63.05
  },
  "벨라루스": {
    "lat": 53.9,
    "lng": 27.57
  },
  "라트비아": {
    "lat": 56.95,
    "lng": 24.1
  },
  "알바니아": {
    "lat": 41.32,
    "lng": 19.82
  },
  "러시아": {
    "lat": 43.1198,
    "lng": 131.8869
  },
  "마카오": {
    "lat": 22.16666666,
    "lng": 113.55
  },
  "남아프리카 공화국": {
    "lat": -25.7,
    "lng": 28.22
  },
  "저지 섬": {
    "lat": 49.18,
    "lng": -2.1
  },
  "탄자니아": {
    "lat": -6.16,
    "lng": 35.75
  },
  "부룬디": {
    "lat": -3.43,
    "lng": 29.93
  },
  "코모로": {
    "lat": -11.7,
    "lng": 43.23
  },
  "키프로스": {
    "lat": 35.17,
    "lng": 33.37
  },
  "태국": {
    "lat": 13.75,
    "lng": 100.52
  },
  "오스트리아": {
    "lat": 48.2,
    "lng": 16.37
  },
  "스위스": {
    "lat": 46.92,
    "lng": 7.47
  },
  "프랑스령 남부와 남극 지역": {
    "lat": 48.81,
    "lng": -1.4
  },
  "버뮤다": {
    "lat": 32.28,
    "lng": -64.78
  },
  "모로코": {
    "lat": 34.02,
    "lng": -6.82
  },
  "영국령 인도양 지역": {
    "lat": -7.3,
    "lng": 72.4
  },
  "사우스조지아 사우스샌드위치 제도": {
    "lat": -54.28,
    "lng": -36.5
  },
  "콩고": {
    "lat": -4.25,
    "lng": 15.28
  },
  "나우루": {
    "lat": -0.55,
    "lng": 166.92
  },
  "솔로몬 제도": {
    "lat": -9.43,
    "lng": 159.95
  },
  "크리스마스 섬": {
    "lat": -10.42,
    "lng": 105.68
  },
  "에스토니아": {
    "lat": 59.43,
    "lng": 24.72
  },
  "파푸아뉴기니": {
    "lat": -9.45,
    "lng": 147.18
  },
  "싱가포르": {
    "lat": 1.28,
    "lng": 103.85
  },
  "프랑스": {
    "lat": 48.87,
    "lng": 2.33
  },
  "미얀마": {
    "lat": 19.76,
    "lng": 96.07
  },
  "스페인": {
    "lat": 40.4,
    "lng": -3.68
  },
  "세이셸": {
    "lat": -4.62,
    "lng": 55.45
  },
  "말라위": {
    "lat": -13.97,
    "lng": 33.78
  },
  "카리브 네덜란드": {
    "lat": 12.14,
    "lng": -68.27
  },
  "카자흐스탄": {
    "lat": 51.16,
    "lng": 71.45
  },
  "리투아니아": {
    "lat": 54.68,
    "lng": 25.32
  },
  "괌": {
    "lat": 13.48,
    "lng": 144.75
  },
  "차드": {
    "lat": 12.1,
    "lng": 15.03
  },
  "통가": {
    "lat": -21.13,
    "lng": -175.2
  },
  "왈리스 푸투나": {
    "lat": -13.95,
    "lng": -171.93
  },
  "콜롬비아": {
    "lat": 4.71,
    "lng": -74.07
  },
  "마다가스카르": {
    "lat": -18.92,
    "lng": 47.52
  },
  "지브롤터": {
    "lat": 36.13,
    "lng": -5.35
  },
  "남수단": {
    "lat": 4.85,
    "lng": 31.62
  },
  "중국": {
    "lat": 39.92,
    "lng": 116.38
  },
  "홍콩": {
    "lat": 22.267,
    "lng": 114.188
  },
  "코소보": {
    "lat": 42.67,
    "lng": 21.17
  },
  "한국": {
    "lat": 37.55,
    "lng": 126.98
  },
  "니우에": {
    "lat": -19.02,
    "lng": -169.92
  },
  "감비아": {
    "lat": 13.45,
    "lng": -16.57
  },
  "독일": {
    "lat": 52.52,
    "lng": 13.4
  },
  "헝가리": {
    "lat": 47.5,
    "lng": 19.08
  },
  "세르비아": {
    "lat": 44.83,
    "lng": 20.5
  },
  "투르크메니스탄": {
    "lat": 37.95,
    "lng": 58.38
  },
  "스발바르 얀마옌 제도": {
    "lat": 78.22,
    "lng": 15.63
  },
  "프랑스령 폴리네시아": {
    "lat": -17.53,
    "lng": -149.56
  },
  "팔레스타인": {
    "lat": 31.9,
    "lng": 35.2
  },
  "쿠웨이트": {
    "lat": 29.37,
    "lng": 47.97
  },
  "안도라": {
    "lat": 42.5,
    "lng": 1.52
  },
  "나이지리아": {
    "lat": 9.08,
    "lng": 7.53
  },
  "레위니옹": {
    "lat": -20.88,
    "lng": 55.45
  },
  "라이베리아": {
    "lat": 6.3,
    "lng": -10.8
  },
  "트리니다드 토바고": {
    "lat": 10.65,
    "lng": -61.52
  },
  "서사하라": {
    "lat": -13.28,
    "lng": 27.14
  },
  "몰타": {
    "lat": 35.88,
    "lng": 14.5
  },
  "세인트헬레나": {
    "lat": -15.93,
    "lng": -5.72
  },
  "미크로네시아": {
    "lat": 6.92,
    "lng": 158.15
  },
  "지부티": {
    "lat": 11.58,
    "lng": 43.15
  },
  "터크스 케이커스 제도": {
    "lat": 21.46,
    "lng": -71.14
  },
  "마르티니크": {
    "lat": 14.6,
    "lng": -61.08
  },
  "말리": {
    "lat": 12.65,
    "lng": -8
  },
  "브라질": {
    "lat": -15.79,
    "lng": -47.88
  },
  "푸에르토리코": {
    "lat": 18.47,
    "lng": -66.12
  },
  "나미비아": {
    "lat": -22.57,
    "lng": 17.08
  },
  "마요트": {
    "lat": -12.78,
    "lng": 45.22
  },
  "올란드 제도": {
    "lat": 60.12,
    "lng": 19.9
  },
  "칠레": {
    "lat": -33.45,
    "lng": -70.67
  },
  "모리타니": {
    "lat": 18.07,
    "lng": -15.97
  },
  "팔라우": {
    "lat": 7.5,
    "lng": 134.62
  },
  "미국령 버진아일랜드": {
    "lat": 18.35,
    "lng": -64.93
  },
  "말레이시아": {
    "lat": 3.17,
    "lng": 101.7
  },
  "수단": {
    "lat": 15.6,
    "lng": 32.53
  },
  "생마르탱": {
    "lat": 18.07,
    "lng": -63.08
  },
  "신트마르턴": {
    "lat": 18.02,
    "lng": -63.03
  },
  "아르헨티나": {
    "lat": -34.58,
    "lng": -58.67
  },
  "케이맨 제도": {
    "lat": 19.3,
    "lng": -81.38
  },
  "과테말라": {
    "lat": 14.62,
    "lng": -90.52
  },
  "건지 섬": {
    "lat": 49.45,
    "lng": -2.54
  },
  "도미니카": {
    "lat": 15.3,
    "lng": -61.4
  },
  "아이티": {
    "lat": 18.53,
    "lng": -72.33
  },
  "노르웨이": {
    "lat": 59.92,
    "lng": 10.75
  },
  "불가리아": {
    "lat": 42.68,
    "lng": 23.32
  },
  "바누아투": {
    "lat": -17.73,
    "lng": 168.32
  },
  "베트남": {
    "lat": 21.03,
    "lng": 105.85
  },
  "가봉": {
    "lat": 0.38,
    "lng": 9.45
  },
  "아이슬란드": {
    "lat": 64.15,
    "lng": -21.95
  },
  "생피에르 미클롱": {
    "lat": 46.77,
    "lng": -56.18
  },
  "그린란드": {
    "lat": 64.18,
    "lng": -51.75
  },
  "부탄": {
    "lat": 27.47,
    "lng": 89.63
  },
  "그리스": {
    "lat": 37.98,
    "lng": 23.73
  },
  "체코": {
    "lat": 50.08,
    "lng": 14.47
  },
  "우크라이나": {
    "lat": 50.43,
    "lng": 30.52
  },
  "바티칸": {
    "lat": 41.9,
    "lng": 12.45
  },
  "조선": {
    "lat": 39.02,
    "lng": 125.75
  },
  "코트디부아르": {
    "lat": 6.82,
    "lng": -5.27
  },
  "스웨덴": {
    "lat": 59.33,
    "lng": 18.05
  },
  "네팔": {
    "lat": 27.72,
    "lng": 85.32
  },
  "타지키스탄": {
    "lat": 38.55,
    "lng": 68.77
  },
  "가나": {
    "lat": 5.55,
    "lng": -0.22
  },
  "오만": {
    "lat": 23.62,
    "lng": 58.58
  },
  "바하마": {
    "lat": 25.08,
    "lng": -77.35
  },
  "모나코": {
    "lat": 43.73,
    "lng": 7.42
  },
  "잠비아": {
    "lat": -15.42,
    "lng": 28.28
  },
  "니카라과": {
    "lat": 12.13,
    "lng": -86.25
  },
  "온두라스": {
    "lat": 14.1,
    "lng": -87.22
  },
  "카메룬": {
    "lat": 3.85,
    "lng": 11.5
  },
  "에리트레아": {
    "lat": 15.33,
    "lng": 38.93
  },
  "투발루": {
    "lat": -8.52,
    "lng": 179.22
  },
  "소말리아": {
    "lat": 2.07,
    "lng": 45.33
  },
  "벨리즈": {
    "lat": 17.25,
    "lng": -88.77
  },
  "몬테네그로": {
    "lat": 42.43,
    "lng": 19.27
  },
  "베네수엘라": {
    "lat": 10.48,
    "lng": -66.87
  },
  "레바논": {
    "lat": 33.87,
    "lng": 35.5
  },
  "예멘": {
    "lat": 15.37,
    "lng": 44.19
  },
  "키르기스스탄": {
    "lat": 42.87,
    "lng": 74.6
  },
  "터키": {
    "lat": 39.93,
    "lng": 32.87
  },
  "바베이도스": {
    "lat": 13.1,
    "lng": -59.62
  },
  "적도 기니": {
    "lat": 3.75,
    "lng": 8.78
  },
  "폴란드": {
    "lat": 52.25,
    "lng": 21
  },
  "네덜란드": {
    "lat": 52.35,
    "lng": 4.92
  },
  "미국령 군소 제도": {
    "lat": 19.3,
    "lng": 166.633333
  },
  "파라과이": {
    "lat": -25.28,
    "lng": -57.57
  },
  "키리바시": {
    "lat": 1.33,
    "lng": 172.98
  },
  "알제리": {
    "lat": 36.75,
    "lng": 3.05
  },
  "자메이카": {
    "lat": 17.99702,
    "lng": -76.79358
  },
  "인도": {
    "lat": 28.6,
    "lng": 77.2
  },
  "시에라리온": {
    "lat": 8.48,
    "lng": -13.23
  },
  "과들루프": {
    "lat": 16.03,
    "lng": -61.73
  },
  "조지아": {
    "lat": 41.68,
    "lng": 44.83
  },
  "도미니카 공화국": {
    "lat": 18.47,
    "lng": -69.9
  },
  "피지": {
    "lat": -18.13,
    "lng": 178.42
  },
  "몬트세랫": {
    "lat": 16.7,
    "lng": -62.22
  },
  "동티모르": {
    "lat": -8.58,
    "lng": 125.6
  },
  "시리아": {
    "lat": 33.5,
    "lng": 36.3
  },
  "우루과이": {
    "lat": -34.85,
    "lng": -56.17
  },
  "아제르바이잔": {
    "lat": 40.38,
    "lng": 49.87
  },
  "짐바브웨": {
    "lat": -17.82,
    "lng": 31.03
  },
  "페로 제도": {
    "lat": 62.01,
    "lng": -6.77
  },
  "리비아": {
    "lat": 32.88,
    "lng": 13.17
  },
  "상투메 프린시페": {
    "lat": 0.34,
    "lng": 6.73
  },
  "우즈베키스탄": {
    "lat": 41.32,
    "lng": 69.25
  },
  "에콰도르": {
    "lat": -0.22,
    "lng": -78.5
  },
  "일본": {
    "lat": 35.68,
    "lng": 139.75
  },
  "케냐": {
    "lat": -1.28,
    "lng": 36.82
  },
  "앤티가 바부다": {
    "lat": 17.12,
    "lng": -61.85
  },
  "인도네시아": {
    "lat": -6.17,
    "lng": 106.82
  },
  "퀴라소": {
    "lat": 12.1,
    "lng": -68.92
  },
  "마셜 제도": {
    "lat": 7.1,
    "lng": 171.38
  },
  "니제르": {
    "lat": 13.52,
    "lng": 2.12
  },
  "포르투갈": {
    "lat": 38.72,
    "lng": -9.13
  },
  "아랍에미리트": {
    "lat": 24.47,
    "lng": 54.37
  },
  "대만": {
    "lat": 25.03,
    "lng": 121.52
  },
  "보스니아 헤르체고비나": {
    "lat": 43.87,
    "lng": 18.42
  },
  "가이아나": {
    "lat": 6.8,
    "lng": -58.15
  },
  "아프가니스탄": {
    "lat": 34.52,
    "lng": 69.18
  },
  "몰디브": {
    "lat": 4.17,
    "lng": 73.51
  },
  "세인트루시아": {
    "lat": 14,
    "lng": -61
  },
  "몽골": {
    "lat": 47.92,
    "lng": 106.91
  },
  "수리남": {
    "lat": 5.83,
    "lng": -55.17
  },
  "부베 섬": {
    "lat": -54.4208,
    "lng": 3.3464
  },
  "이스라엘": {
    "lat": 31.77,
    "lng": 35.23
  },
  "캄보디아": {
    "lat": 11.55,
    "lng": 104.92
  },
  "스리랑카": {
    "lat": 6.89,
    "lng": 79.9
  },
  "보츠와나": {
    "lat": -24.63,
    "lng": 25.9
  },
  "노퍽 섬": {
    "lat": -29.05,
    "lng": 167.97
  }
} as const;
